/* Unit Test Runner: t-rexx */
function = 'HelloWorld'
context('Checking the' function 'function')

/* Unit tests */
check('Say Hi!', function||'()',, 'to be', "Hello, World!")
