/* Unit Test Runner: t-rexx */
context('Checking the HelloWorld function')

/* Unit tests */
check('Say Hi!' 'HelloWorld()',,
      'HelloWorld()',, '=', "Hello, World!")

